# RbsCurvetypeDefaultMechjointParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsCurvetypeDefaultMechjointParam Property
ParameterTypeId Class See Also
---
"Flange"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsCurvetypeDefaultMechjointParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsCurvetypeDefaultMechjointParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsCurvetypeDefaultMechjointParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace